<!DOCTYPE HTML>
<html>
<head>
  <meta charset="utf-8">
  <meta http-equiv="X-UA-Compatible" content="chrome=1">
  
  <title>about | Hexo</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
  
    <meta name="author" content="John Doe">
  
  
    <meta name="description" content="个人信息
男的
生日1986.06.19 
大学在郑州大学材料学院读的包装工程专业 
百度 · 前端工程师


工作经历&quot;&gt;百度 (2015年3月 ~ 至今) 前端工程师 」```1### &amp;#25945;&amp;#32946;&amp;#20449;&amp;#36151;&amp;#20027;&amp;#20135;&amp;#21697;istudy&amp;#21450;&amp;#20854;cms&amp;#31995;&amp;#32479;&amp;#30340;">
  
  <meta name="description" content="个人信息
男的
生日1986.06.19 
大学在郑州大学材料学院读的包装工程专业 
百度 · 前端工程师


工作经历&quot;&amp;gt;百度 (2015年3月 ~ 至今) 前端工程师 」```1### &amp;#25945;&amp;#32946;&amp;#20449;&amp;#36151;&amp;#20027;&amp;#20135;&amp;#21697;istudy&amp;#21450;&amp;#20854;cms&amp;#31995;&amp;#32479;&amp;#30340;">
<meta property="og:type" content="website">
<meta property="og:title" content="about">
<meta property="og:url" content="http://yoursite.com/about/index.html">
<meta property="og:site_name" content="Hexo">
<meta property="og:description" content="个人信息
男的
生日1986.06.19 
大学在郑州大学材料学院读的包装工程专业 
百度 · 前端工程师


工作经历&quot;&amp;gt;百度 (2015年3月 ~ 至今) 前端工程师 」```1### &amp;#25945;&amp;#32946;&amp;#20449;&amp;#36151;&amp;#20027;&amp;#20135;&amp;#21697;istudy&amp;#21450;&amp;#20854;cms&amp;#31995;&amp;#32479;&amp;#30340;">
<meta property="og:updated_time" content="2015-10-09T10:01:18.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="about">
<meta name="twitter:description" content="个人信息
男的
生日1986.06.19 
大学在郑州大学材料学院读的包装工程专业 
百度 · 前端工程师


工作经历&quot;&amp;gt;百度 (2015年3月 ~ 至今) 前端工程师 」```1### &amp;#25945;&amp;#32946;&amp;#20449;&amp;#36151;&amp;#20027;&amp;#20135;&amp;#21697;istudy&amp;#21450;&amp;#20854;cms&amp;#31995;&amp;#32479;&amp;#30340;">
  
  
  <link rel="stylesheet" href="/css/style.css" type="text/css">
  <!--[if lt IE 9]><script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script><![endif]-->
  
</head>

<body>
  <div class="wrapper">
    <header id="header">
  <div class="title">
    <h1><a href="/">Hexo</a></h1>
    <p><a href="/"></a></p>
  </div>
  <nav class="nav">
    <ul>
      
        <li><a href="/">Home</a></li>
      
        <li><a href="/archives">Archives</a></li>
      
        <li><a href="/reading">Reading</a></li>
      
        <li><a href="/about">About</a></li>
      
      
    </ul>
    <div class="clearfix"></div>
  </nav>
  <div class="clearfix"></div>
</header>
    <div class="content"><article class="page">
  <header>
    
    
  
    <h1 class="title">about</h1>
  

  </header>
  
  <div class="entry">
    
      <h1 id="个人信息">个人信息</h1><ul>
<li>男的</li>
<li>生日1986.06.19 </li>
<li>大学在郑州大学材料学院读的包装工程专业 </li>
<li>百度 · 前端工程师</li>
</ul>
<hr>
<h1 id="工作经历">工作经历</h1><h2 id="百度_(2015年3月_~_至今)_<!-￼0->">百度 (2015年3月 ~ 至今) <figure class="highlight"><figcaption><span>前端工程师 」```</span></figcaption><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">### &#25945;&#32946;&#20449;&#36151;&#20027;&#20135;&#21697;istudy&#21450;&#20854;cms&#31995;&#32479;&#30340;&#37325;&#26500;&#10;&#10;&#24180;&#20013;&#30340;&#26102;&#20505;&#65292;&#20107;&#19994;&#37096;&#37319;&#21462;&#20135;&#21697;&#26465;&#32447;&#31649;&#29702;&#30340;&#27169;&#24335;&#65292;&#25105;&#34987;&#21010;&#20998;&#21040;&#25945;&#32946;&#20449;&#36151;&#26041;&#21521;&#24037;&#20316;&#12290;&#25945;&#32946;&#20449;&#36151;&#30340;&#19994;&#21153;&#20027;&#35201;&#30001;&#19977;&#20010;&#31995;&#32479;&#25903;&#25745;&#12290;&#23545;&#29992;&#25143;&#30340;istudy&#24179;&#21488;&#65292;&#29992;&#20110;&#21521;&#29992;&#25143;&#23637;&#31034;&#21830;&#25143;&#25552;&#20379;&#30340;&#20135;&#21697;&#12289;&#23545;&#36816;&#33829;&#30340;cms&#31995;&#32479;&#65292;&#29992;&#20110;&#31649;&#29702;&#35838;&#31243;&#21644;&#21830;&#25143;&#30340;&#21508;&#31181;&#20449;&#24687;&#12289;&#21644;&#23545;&#21830;&#25143;&#30340;bshop&#31995;&#32479;&#65292;&#29992;&#20110;&#21830;&#25143;&#26597;&#35810;&#35838;&#31243;&#30340;&#30003;&#35831;&#24773;&#20917;&#36319;&#36827;&#21518;&#32493;&#27969;&#31243;&#12290;&#36825;&#19977;&#22871;&#31995;&#32479;&#26368;&#26089;&#30001;&#22806;&#21253;&#20351;&#29992;java&#24320;&#21457;&#65292;&#30001;&#20110;&#35774;&#35745;&#19978;&#30340;&#19981;&#21512;&#29702;&#21644;&#20154;&#21147;&#38382;&#39064;&#65292;&#26080;&#27861;&#24555;&#36895;&#24212;&#23545;&#38656;&#27714;&#30340;&#21464;&#21270;&#65292;&#26368;&#21518;&#20915;&#23450;&#37325;&#26500;&#20026;PHP&#23454;&#29616;&#12290;&#20854;&#20013;istudy&#24179;&#21488;&#21644;cms&#31995;&#32479;&#21069;&#31471;&#30340;&#37325;&#26500;&#30001;&#25105;&#36127;&#36131;&#12290;&#10;&#10;&#22374;&#30333;&#35828;&#36825;&#20010;&#39033;&#30446;&#30340;&#24037;&#20316;&#25216;&#26415;&#21547;&#37327;&#19981;&#39640;&#65292;&#22823;&#37096;&#20998;&#26102;&#38388;&#32791;&#36153;&#22312;&#25509;&#21475;&#30340;&#25972;&#29702;&#19978;&#12290;&#30001;&#20110;&#21407;&#26469;&#24320;&#21457;&#26681;&#26412;&#27809;&#26377;&#25991;&#26723;&#65292;&#38656;&#35201;&#23558;&#25152;&#26377;&#25509;&#21475;&#20174;&#20195;&#30721;&#20013;&#25972;&#29702;&#20986;&#26469;&#8230;&#8230;&#22312;&#36825;&#20010;&#39033;&#30446;&#20013;&#25105;&#20027;&#35201;&#36127;&#36131;&#30340;&#23601;&#26159;&#36825;&#37096;&#20998;&#24037;&#20316;&#65292;&#26399;&#38388;&#31359;&#25554;&#24320;&#21457;&#20102;&#19968;&#20123;&#36816;&#33829;&#27963;&#21160;&#12290;&#10;&#10;&#30001;&#20110;&#23545;&#36827;&#24230;&#21644;&#20154;&#21592;&#30340;&#21512;&#29702;&#23433;&#25490;&#65292;&#37325;&#26500;&#30340;&#24037;&#20316;&#25552;&#21069;&#23436;&#24037;&#20102;&#12290;&#20043;&#21518;&#30340;&#37325;&#28857;&#20027;&#35201;&#25918;&#22312;&#20248;&#21270;&#26041;&#26696;&#19978;&#12290;&#21518;&#26469;&#36319;&#36127;&#36131;bshop&#30340;&#21069;&#31471;&#24037;&#31243;&#24072;&#19968;&#36215;&#21046;&#23450;&#20102;&#23637;&#31034;&#31471;&#25552;&#21319;&#21069;&#31471;&#24615;&#33021;&#65292;&#31649;&#29702;&#31471;&#25552;&#21319;&#32452;&#20214;&#21270;&#31243;&#24230;&#30340;&#20248;&#21270;&#26041;&#26696;&#12290;&#20854;&#20013;&#31649;&#29702;&#31471;&#26041;&#26696;&#24050;&#32463;&#22522;&#26412;&#23436;&#25104;&#65292;&#31561;&#20043;&#21518;&#26377;&#26032;&#21151;&#33021;&#19978;&#32447;&#65292;&#23436;&#25104;&#32447;&#19978;&#27979;&#35797;&#65292;&#20415;&#21487;&#36880;&#27493;&#26367;&#25442;&#26087;&#32452;&#20214;&#20102;&#12290;&#23637;&#31034;&#31471;&#30340;&#20248;&#21270;&#36824;&#22312;&#23454;&#26045;&#20013;&#12290;&#10;&#10;#### &#36127;&#36131;&#24037;&#20316;&#65306;&#10; - &#25776;&#20889;&#21069;&#31471;&#20132;&#20114;&#25509;&#21475;&#25991;&#26723;&#10; - &#25511;&#21046;&#20195;&#30721;&#36136;&#37327;&#10; - &#20219;&#21153;&#20998;&#37197;&#10; - &#36827;&#24230;&#27719;&#25253;&#10; - &#22806;&#21253;&#20154;&#21592;&#31649;&#29702;&#10; - &#21046;&#23450;&#20248;&#21270;&#26041;&#26696;&#10;&#10;### &#30334;&#24230;&#26377;&#38065;&#20027;&#20135;&#21697;web&#29256;&#32593;&#31449;&#10;&#10;&#25105;&#25152;&#22312;&#30340;&#37096;&#38376;&#26159;&#37329;&#34701;&#20107;&#19994;&#37096;&#65292;&#26159;&#19968;&#20010;&#30334;&#24230;&#20869;&#37096;&#30340;&#21019;&#19994;&#37096;&#38376;&#65292;&#19982;14&#24180;&#24180;&#20302;&#25104;&#31435;&#65292;&#25105;&#26159;&#20316;&#20026;&#35813;&#37096;&#38376;&#31532;&#19968;&#25209;&#21592;&#24037;&#21152;&#20837;&#30340;&#12290;&#30334;&#24230;&#26377;&#38065;&#26159;&#37329;&#34701;&#20107;&#19994;&#37096;&#30340;&#20027;&#35201;&#20135;&#21697;&#65292;&#20854;&#19994;&#21153;&#26159;&#28040;&#36153;&#31867;&#23567;&#39069;&#36151;&#27454;&#65292;&#31867;&#20284;&#20140;&#19996;&#30333;&#26465;&#65292;&#38463;&#37324;&#33457;&#21591;&#12290;web&#29256;&#21644;app&#29256;&#26159;&#20027;&#35201;&#30340;&#20004;&#22823;&#20837;&#21475;&#65292;&#20027;&#35201;&#25552;&#20379;&#20102;&#27880;&#20876;&#65292;&#36523;&#20221;&#35748;&#35777;&#65292;&#36151;&#27454;&#23457;&#26680;&#65292;&#25552;&#29616;&#65292;&#36824;&#27454;&#31561;&#19968;&#31995;&#21015;&#21151;&#33021;&#12290;&#10;&#10;&#32771;&#34385;&#21040;&#19982;&#38134;&#34892;&#31995;&#32479;&#12289;&#37329;&#34701;&#19994;&#21153;&#21518;&#21488;&#31995;&#32479;&#23545;&#25509;&#26041;&#20415;&#65292;&#26368;&#26089;&#36825;&#20010;&#20135;&#21697;&#26159;&#25171;&#31639;&#29992;java&#26469;&#20316;&#20026;&#26381;&#21153;&#31471;&#35821;&#35328;&#24320;&#21457;&#30340;&#12290;&#20294;&#26159;&#22240;&#20026;&#23384;&#22312;&#30528;&#24320;&#21457;&#25104;&#26412;&#39640;&#12289;&#19981;&#33021;&#21450;&#26102;&#21709;&#24212;&#38656;&#27714;&#21464;&#26356;&#31561;&#38382;&#39064;&#65292;&#21518;&#26469;&#23558;&#21518;&#31471;&#35821;&#35328;&#20999;&#25442;&#20026;php&#12290;&#32463;fex&#30340;&#21516;&#23398;&#24067;&#36947;&#65292;&#21069;&#31471;&#26368;&#32456;&#36873;&#25321;&#20102;&#20351;&#29992;fis-plus&#20316;&#20026;&#26694;&#26550;&#65292;&#30001;&#21069;&#31471;&#22242;&#38431;&#25509;&#31649;&#27169;&#26495;&#23618;&#65292;&#21518;&#31471;&#24037;&#31243;&#24072;&#21487;&#20197;&#21482;&#32858;&#28966;&#22312;&#19994;&#21153;&#36923;&#36753;&#19978;&#12290;&#21516;&#26102;&#65292;&#25105;&#21046;&#23450;&#20102;&#30001;&#21069;&#31471;&#20027;&#23548;&#20132;&#20114;&#25509;&#21475;&#35774;&#35745;&#30340;&#24037;&#20316;&#27969;&#31243;&#12290;&#30001;&#21069;&#31471;&#39537;&#21160;&#20132;&#20114;&#25509;&#21475;&#30340;&#35774;&#35745;&#65292;&#27979;&#35797;&#31561;&#24037;&#20316;&#12290;&#36825;&#26679;&#33021;&#26377;&#25928;&#20943;&#23569;&#20102;&#21069;&#21518;&#31471;&#24037;&#20316;&#30340;&#32806;&#21512;&#24230;&#65292;&#32780;&#19988;&#22312;&#38656;&#27714;&#30830;&#23450;&#12289;&#20132;&#20114;&#21407;&#22411;&#30830;&#23450;&#30340;&#26102;&#20505;&#65292;&#21069;&#21518;&#31471;&#20415;&#21487;&#21516;&#26102;&#36827;&#20837;&#24320;&#21457;&#65292;&#32553;&#30701;&#24320;&#21457;&#21608;&#26399;&#12290;&#10;&#10;&#30001;&#20110;&#24403;&#26102;&#20154;&#21147;&#19981;&#36275;&#65292;&#22312;&#35774;&#35745;&#22909;&#25509;&#21475;&#25776;&#20889;&#22909;&#25991;&#26723;&#20043;&#21518;&#65292;&#21518;&#32493;&#22823;&#37096;&#20998;&#30340;&#24320;&#21457;&#24037;&#20316;&#37117;&#30001;&#22806;&#21253;&#21592;&#24037;&#36319;&#36827;&#12290;&#25105;&#20027;&#35201;&#36127;&#36131;&#22521;&#35757;&#26694;&#26550;&#20351;&#29992;&#12289;&#35774;&#35745;&#33258;&#21160;&#21270;&#24037;&#20316;&#27969;&#12289;&#35774;&#35745;&#21069;&#31471;&#20248;&#21270;&#26041;&#26696;&#12289;&#35843;&#25972;&#24320;&#21457;&#36827;&#24230;&#12289;&#25351;&#23548;&#35299;&#20915;&#30097;&#38590;&#38382;&#39064;&#31561;&#24037;&#20316;&#12290;&#10;&#10;#### &#36127;&#36131;&#24037;&#20316;&#65306;&#10; - &#25216;&#26415;&#35843;&#30740;&#10; - &#35774;&#35745;&#21069;&#31471;&#24320;&#21457;&#26550;&#26500;&#10; - &#25776;&#20889;&#21069;&#31471;&#20132;&#20114;&#25509;&#21475;&#25991;&#26723;&#10; - &#24320;&#21457;&#20844;&#20849;&#32452;&#20214;&#10; - &#32534;&#20889;&#27979;&#35797;&#25968;&#25454;&#10; - &#20219;&#21153;&#20998;&#37197;&#10; - &#36827;&#24230;&#27719;&#25253;&#10; - &#22806;&#21253;&#20154;&#21592;&#22521;&#35757;&#10; - &#22806;&#21253;&#20154;&#21592;&#31649;&#29702;&#10;&#10;## &#23453;&#23453;&#26641; (2014&#24180;2&#26376; ~ 2015&#24180;3&#26376;) ```&#12300; &#21069;&#31471;&#24037;&#31243;&#24072; &#12301;</span><br></pre></td></tr></table></figure></h2><h3 id="公司pc站试用频道重构">公司pc站试用频道重构</h3><p>试用频道是一个可以在线申请商品进行试用，同时你能做出评价评论的一个平台，由于年代久远，整个频道的样式以及前端脚本都处于废弃状态，这个项目是作为公司pc站改版计划的第一部分进行的，同时也是我所在的前端团队的一种尝试，正式将模块化加载和自动化工作流正式引入到工作流程中。</p>
<p>这也是我首次带领团队其他成员一起参与项目，平时工作也由开发功能，转向了需求整理，任务分配，自动化工具规划等等，对于我来说也是一个全新的挑战。</p>
<h4 id="负责工作：">负责工作：</h4><ul>
<li>前端需求整理</li>
<li>任务分配</li>
<li>进度汇报</li>
<li>自动化工作流开发</li>
</ul>
<h3 id="app内嵌闪购频道">app内嵌闪购频道</h3><p>最早这个产品是以一个频道的形势出现在app中的，于14年中上线，现已成功发展为公司下属分公司。</p>
<p>项目采用类似于hybridapp的开发方式，用webview将webapp潜入nativeapp中，充分利用webapp的优势进行快速迭代，同时又可以调用nativeapp的强大功能。因为是交互比较简单的CRUD型应用，最终选择用angularjs来开发，大大提高了开发效率。该项目中我主要负责日常需求功能的实现，由于项目期间出色的完成了工作，于当年被评为部门最佳员工。</p>
<h4 id="负责工作：-1">负责工作：</h4><ul>
<li>前端需求实现</li>
<li>公共组件开发</li>
<li>自动化工作流开发</li>
</ul>
<h2 id="北大方正_(2011年7月_~_2014年2月)_<!-￼1->">北大方正 (2011年7月 ~ 2014年2月) <figure class="highlight"><figcaption><span>前端工程师 」```</span></figcaption><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">&#10;### &#37325;&#26500;E5&#22522;&#30784;&#24179;&#21488;&#10;E5&#22522;&#30784;&#24179;&#21488;&#26159;&#20844;&#21496;&#25152;&#26377;&#20135;&#21697;&#30340;&#22522;&#30784;&#65292;&#20854;&#20869;&#37096;&#25972;&#21512;&#20102;&#22823;&#37327;&#24120;&#29992;&#21151;&#33021;&#21644;&#27169;&#26495;&#65292;&#33021;&#22815;&#24555;&#36895;&#25645;&#24314;&#20986;&#20135;&#21697;&#30340;&#26680;&#24515;&#31995;&#32479;&#21644;&#22522;&#30784;&#30028;&#38754;&#65292;&#30001;&#20110;&#31995;&#32479;&#30740;&#21457;&#26102;&#38388;&#30340;&#27604;&#36739;&#26089;&#65292;&#19988;&#36739;&#38271;&#26102;&#38388;&#26410;&#26356;&#26032;&#32500;&#25252;&#65292;&#23384;&#22312;&#36739;&#22810;&#38382;&#39064;&#65292;&#20854;&#20013;&#21069;&#31471;&#24615;&#33021;&#19982;&#21487;&#32500;&#25252;&#24615;&#38382;&#39064;&#26368;&#20026;&#31361;&#20986;&#12290;&#10;&#10;&#35813;&#24179;&#21488;&#30340;&#37325;&#26500;&#26159;&#24403;&#26102;&#30340;&#37325;&#28857;&#39033;&#30446;&#65292;&#21382;&#26102;&#20004;&#20010;&#26376;&#30340;&#23553;&#38381;&#24320;&#21457;&#65292;&#24403;&#26102;&#19981;&#24471;&#19981;&#37325;&#26500;&#30340;&#20027;&#35201;&#21407;&#22240;&#23601;&#26159;&#22240;&#20026;&#21069;&#31471;&#27169;&#22359;&#30340;&#31649;&#29702;&#36807;&#20110;&#21407;&#22987;&#65292;&#12290;&#24403;&#26102;&#32769;&#29256;&#26412;&#31995;&#32479;&#26159;&#20351;&#29992;iframe&#26500;&#24314;&#21069;&#31471;&#27169;&#22359;&#21270;&#30340;&#65292;&#36825;&#31181;&#26041;&#24335;&#34429;&#28982;&#31616;&#21333;&#26041;&#20415;&#65292;&#20294;&#26159;&#38543;&#30528;&#21069;&#31471;&#36923;&#36753;&#22797;&#26434;&#24230;&#22686;&#39640;&#65292;&#20854;&#27169;&#22359;&#38388;&#27807;&#36890;&#20132;&#20114;&#22256;&#38590;&#65292;&#20869;&#23481;&#26356;&#26032;&#21518;&#19981;&#22909;&#23637;&#31034;&#65292;&#36328;&#22495;&#31561;&#38382;&#39064;&#36880;&#28176;&#26292;&#38706;&#20986;&#26469;&#65292;&#32473;&#22312;&#24179;&#21488;&#19978;&#20108;&#27425;&#24320;&#21457;&#36896;&#25104;&#20102;&#26497;&#22823;&#30340;&#22256;&#38590;&#12290;&#25925;&#37325;&#26032;&#35774;&#35745;&#20102;&#26032;&#30340;&#21069;&#31471;&#27169;&#22359;&#21270;&#26426;&#21046;&#65292;&#23558;iframe&#26694;&#26550;&#36716;&#21464;&#20026;&#24322;&#27493;&#21152;&#36733;&#12290;&#10;&#10;#### &#36127;&#36131;&#24037;&#20316;&#65306; &#10; - &#21069;&#31471;&#27169;&#22359;&#21270;&#26426;&#21046;&#35774;&#35745;&#10; - javascript&#33050;&#26412;&#32534;&#20889;&#10; - &#26679;&#24335;&#21450;&#20132;&#20114;&#20307;&#39564;&#20248;&#21270;&#10;&#10;### &#20840;&#23186;&#20307;&#29983;&#20135;&#31995;&#32479;3.0 &#10;&#20840;&#23186;&#20307;&#29983;&#20135;&#31995;&#32479;&#26159;&#19968;&#22871;&#19987;&#38376;&#20026;&#25253;&#31038;&#26434;&#24535;&#31038;&#31561;&#25253;&#19994;&#20844;&#21496;&#26381;&#21153;&#30340;&#31649;&#29702;&#31995;&#32479;&#65292;&#26368;&#26089;&#36825;&#22871;&#31995;&#32479;&#26159;cs&#31995;&#32479;&#65292;&#21518;&#26469;&#38543;&#30528;&#20114;&#32852;&#32593;&#25216;&#26415;&#26085;&#36235;&#25104;&#29087;&#65292;&#20844;&#21496;&#20915;&#23450;&#23558;&#20854;&#25913;&#36896;&#20026;bs&#31995;&#32479;&#65292;&#30001;&#20110;&#26368;&#21021;&#24320;&#21457;bs&#29256;&#26412;&#30340;&#31243;&#24207;&#21592;&#37117;&#26159;&#36719;&#20214;&#24037;&#31243;&#24072;&#65292;&#23545;&#21069;&#31471;&#24037;&#31243;&#24182;&#19981;&#30475;&#37325;&#65292;&#23548;&#33268;&#31995;&#32479;&#29992;&#25143;&#20307;&#39564;&#19981;&#22909;&#65292;&#20002;&#22833;&#25481;&#20102;&#22823;&#37096;&#20998;&#24066;&#22330;&#20221;&#39069;&#65292;&#26032;&#29256;&#26412;&#26088;&#22312;&#20248;&#21270;&#21069;&#31471;&#24615;&#33021;&#65292;&#25913;&#21892;&#29992;&#25143;&#20307;&#39564;&#12290; &#10;&#10;&#30001;&#20110;&#20043;&#21069;&#22242;&#38431;&#27809;&#26377;&#19987;&#38376;&#36127;&#36131;&#21069;&#31471;&#30340;&#20154;&#65292;&#25105;&#21152;&#20837;&#20043;&#21518;&#22312;&#39033;&#30446;&#20013;&#29420;&#33258;&#19968;&#20154;&#25215;&#25285;&#20102;&#25972;&#20010;&#31995;&#32479;&#21069;&#31471;&#24320;&#21457;&#30340;&#24037;&#20316;&#65292;&#23436;&#25104;&#20102;&#22823;&#37096;&#20998;&#39029;&#38754;&#23637;&#31034;&#12289;&#21069;&#31471;&#20132;&#20114;&#33050;&#26412;&#12289;&#21069;&#31471;&#19994;&#21153;&#33050;&#26412;&#30340;&#24320;&#21457;&#65292;&#24037;&#20316;&#25104;&#26524;&#24471;&#21040;&#20102;&#39046;&#23548;&#21644;&#21516;&#20107;&#30340;&#19968;&#33268;&#22909;&#35780;&#65292;&#20973;&#20511;&#23545;&#27492;&#39033;&#30446;&#30340;&#36129;&#29486;&#24403;&#24180;&#34987;&#35780;&#20026;&#26368;&#20339;&#26032;&#21592;&#24037;&#12290;&#10;&#10;#### &#36127;&#36131;&#24037;&#20316;&#65306; &#10; - &#39029;&#38754;&#21046;&#20316;&#10; - javascript&#33050;&#26412;&#32534;&#20889;&#10; - &#21382;&#21490;&#36951;&#30041;javascript&#33050;&#26412;&#20248;&#21270;&#10; - &#20462;&#22797;&#21382;&#21490;&#36951;&#30041;bug&#10; - i18n&#20869;&#23481;&#20248;&#21270;&#10;&#10;## Accentiv&#39; (2008&#24180;4&#26376; ~ 2011&#24180;6&#26376;) ```&#12300; &#32593;&#39029;&#35774;&#35745;&#24072; &#12301;</span><br></pre></td></tr></table></figure></h2><h3 id="AMD_销售管理系统">AMD 销售管理系统</h3><p>AMD销售管理系统是针对AMD销售人员设计的一套管理业绩用系统。销售人员从前台上传自己销售产品的代码获得业绩，管理者通过后台察看每位销售人员的业绩情况，核对后按照销售人员的业绩发放奖励。 </p>
<p>项目期间数次被公司外派参加培训，培训内容包括Flash ActionScript，JavaScript，PHP等课程，在学习的工程中逐渐能够熟练编写脚本程序，并在项目中开始承担编写页面特效动画脚本、页面逻辑脚本的工作。</p>
<h4 id="负责工作：-2">负责工作：</h4><ul>
<li>页面设计</li>
<li>页面制作</li>
<li>javascript脚本编写</li>
</ul>
<h3 id="DHL豪情万礼俱乐部">DHL豪情万礼俱乐部</h3><p>DHL豪情万礼俱乐部是面向中外运敦豪现有帐号客户（不含代理客户和跨渠道客户）的客户积分奖励活动。中外运敦豪客户通过发送快递获得积分，获得的积分可以用来换取礼品、参加抽奖等活动，借以达到刺激客户更多的消费。</p>
<p>加入这个项目时刚参加工作，没什么经验，所以负责的工作很琐碎，在这期间公司派出培训学会了页面制作，并很快将其应用到项目中，进而对前端工程产生了浓厚的兴趣，逐渐开始自学其他前端技术。 </p>
<h4 id="负责工作：-3">负责工作：</h4><ul>
<li>页面设计</li>
<li>页面制作</li>
<li>edm设计</li>
<li>会员期刊、dm单页设计 </li>
<li>网站内容维护</li>
</ul>

    
  </div>
  <footer>
    
      
      
    
    <div class="clearfix"></div>
  </footer>
</article>


<section id="comment">
  <h1 class="title">评论</h1>
  <div class="ds-thread" data-title="about">
  </div>
</section>
</div>
  </div>
  <footer id="footer"><div class="copyright">
  
  &copy; 2015 <a href="/">John Doe</a>
  
</div>
<div class="theme-copyright">
  Theme by <a href="https://github.com/orderedlist" target="_blank">orderedlist</a>
   | 
  Redesign by <a href="http://heroicyang.com/" target="_blank">Heroic Yang</a>
</div>
<div class="clearfix"></div></footer>
  <script src="//ajax.googleapis.com/ajax/libs/jquery/1.8/jquery.min.js"></script>
<script src="/js/scale.fix.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>


<script type="text/javascript">
  var duoshuoQuery = { short_name: '81735595' };
  (function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';
    ds.async = true;
    ds.src = 'http://static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(ds);
  })();
</script>



<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
  (function($){
    $('.fancybox').fancybox();
  })(jQuery);
</script>

</body>
</html>